In [3]:
# Practice with hierarchical indexing
import pandas as pd
import numpy as np

data = pd.Series(np.random.uniform(size=9), index=[["a", "a", "a", "b", "b", "c", "c", "d", "d"], [1, 2, 3, 1, 3, 1, 2, 2, 3]])
data

a  1    0.131251
   2    0.393611
   3    0.708130
b  1    0.486092
   3    0.977988
c  1    0.903106
   2    0.700510
d  2    0.732727
   3    0.410643
dtype: float64

In [5]:
data.loc['a',2]

0.39361126339748786

In [6]:
# Creat a DataFrame from the data Series
df = data.unstack()
df

          1         2         3
a  0.131251  0.393611  0.708130
b  0.486092       NaN  0.977988
c  0.903106  0.700510       NaN
d       NaN  0.732727  0.410643

In [9]:
# DataFrame with hierarchical indexing
frame = pd.DataFrame(np.arange(12).reshape((4, 3)),
                        index=[["a", "a", "b", "b"], [1, 2, 1, 2]],
                        columns=[["Ohio", "Ohio", "Colorado"],
                        ["Green", "Red", "Green"]])
frame

     Ohio     Colorado
    Green Red    Green
a 1     0   1        2
  2     3   4        5
b 1     6   7        8
  2     9  10       11

In [10]:
frame.index.nlevels

2

In [11]:
# Find statistics over certain indexes
frame.index.names = ["key1", "key2"]
frame.columns.names = ["state", "color"]

frame.groupby(level="key2").sum()

state  Ohio     Colorado
color Green Red    Green
key2
1         6   8       10
2        12  14       16

In [13]:
frame = pd.DataFrame({"a": range(7), "b": range(7, 0, -1),
                        "c": ["one", "one", "one", "two", "two",
                        "two", "two"],
                        "d": [0, 1, 2, 0, 1, 2, 3]})
frame

   a  b    c  d
0  0  7  one  0
1  1  6  one  1
2  2  5  one  2
3  3  4  two  0
4  4  3  two  1
5  5  2  two  2
6  6  1  two  3

In [15]:
# Use columns "c" and "d" as indexes in a new dataframe
frame2 = frame.set_index(["c", "d"])
frame2

       a  b
c   d
one 0  0  7
    1  1  6
    2  2  5
two 0  3  4
    1  4  3
    2  5  2
    3  6  1